UTAF_Base/requestFiles/PTS_Organisation_UpdateOrganisation_Events.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://api.web.bc/api/schema/commoncontext/transaction/v1" xmlns:v11="http://api.web.bc/api/schema/commoncontext/consumertransaction/v1" xmlns:v2="http://api.web.bc/api/schema/commoncontext/v2" xmlns:v21="http://api.web.bc/capability/business/b182/objects/requestupdateorganisation/v2" xmlns:v3="http://api.web.bc/capability/business/b182/services/organisation/v3">
   <soapenv:Header>
      <v2:CommonContextRequest>
         <v2:transaction>
            <v1:messageId>${Req_corrId}</v1:messageId>
            <v1:correlationId>${Req_corrId}</v1:correlationId>
         </v2:transaction>
      </v2:CommonContextRequest>
   </soapenv:Header>
   <soapenv:Body>
      <v3:RequestDataUpdateOrganisation version="3.0">
         <v3:serviceContext>
            <v3:transactionData>
               <v3:endUserId>id058127</v3:endUserId>
               <v3:endUserLanguage>EN</v3:endUserLanguage>
               <v3:consumerApplication>CDB</v3:consumerApplication>
            </v3:transactionData>
         </v3:serviceContext>
         <v3:serviceData>
            <v3:organisation>
               <v21:identifier>
                  <v21:id>${Req_organisationId_source}</v21:id>
                  <v21:idScope>
                     <v21:value>ENT</v21:value>
                  </v21:idScope>
                  <v21:idContext>
                     <v21:value>B182</v21:value>
                  </v21:idContext>
               </v21:identifier>
               <v21:party>
                  <v21:relationship updateAction="${Req_updateAction}">
                     <v21:type>
                        <v21:value>IS_SHAREHOLDER_OF</v21:value>
                     </v21:type>
                     <v21:status>
                        <v21:code>
                           <v21:value>ACTIVE</v21:value>
                        </v21:code>
                     </v21:status>
                     <v21:charVal>
                        <v21:characteristicName>percentageOfOwnedShares</v21:characteristicName>
                        <v21:value>${Req_charVal}</v21:value>
                     </v21:charVal>
                     <v21:party>
                        <v21:organisation>
                           <v21:identifier>
                              <v21:id>${Req_organisationId_target}</v21:id>
                              <v21:idScope>
                                 <v21:value>ENT</v21:value>
                              </v21:idScope>
                              <v21:idContext>
                                 <v21:value>B182</v21:value>
                              </v21:idContext>
                           </v21:identifier>
                        </v21:organisation>
                     </v21:party>
                  </v21:relationship>
               </v21:party>
            </v3:organisation>
         </v3:serviceData>
      </v3:RequestDataUpdateOrganisation>
   </soapenv:Body>
</soapenv:Envelope>